/*
    Симдяшкин Александр Денисович
    Для каждой ситуации напишите один литерал (или выражение с литералом), который лучше всего подходит.
    1) Число 255 в шестнадцатеричной системе, тип int.
    2) Число 64 в восьмеричной системе, тип int.
    3) Число 10 в двоичной системе, тип unsigned int.
    4) Число 3.14 с типом float.
    5) Число 0.001 в экспоненциальной форме, тип double.
    6) Число 1024 в шестнадцатеричной экспоненциальной форме (степень 3) двойки), тип double.
    7) Символ новая строка (\n) как символьный литерал.
    8) Строка, содержащая кавычки и обратный слеш, без экранирования (сырая строка).
    9) Логическое значение «истина».
    10) Нулевой указатель.
*/
#include <iostream>
#include <typeinfo>

int main() 
{
    /*
        1) Число 255 в шестнадцатеричной системе, тип int. 
        255 / 16 = 15 остаток 15 => 15 / 16 = 0 остаток 15 => FF
        i - int
    */
    std::cout << "1) " << 0xFF << " тип " << typeid(0xFF).name() << std::endl;
    
    /* 
        2) Число 64 в восьмеричной системе, тип int. 
        64 / 8 = 8 остаток 0 => 8/8 = 1 остаток 0 => 100
        i - int
    */
    std::cout << "2) " << 0100 << " тип " << typeid(0xFF).name() << std::endl;

    /*
        3) Число 10 в двоичной системе, тип unsigned int.
        чтобы дать бинарному литералу тип, нужно указать флаг в конце, в нашем случае для unsigned int делаем U, иначе он просто int будет.
        10 / 2 = 5 остаток 0 => 5 / 2 = 2 остаток 1 => 2 / 2 = 1 остаток 0 => 1 / 2 = 0 остаток 1
        j - unsigned int (j - потому что память экономили, поэтому решили делать строку в 1 символ, а j был после i свободный, поэтому и взяли его)
    */
    std::cout << "3) " << 0b1010U << " тип " << typeid(0b1010U).name() << std::endl;
    
    /*
        4) Число 3.14 с типом float.
        без f соответственно, 3.14 это double.
        f - float
    */
    std::cout << "4) " << 3.14f << " тип " << typeid(3.14f).name() << std::endl;

    /*
        5) Число 0.001 в экспоненциальной форме, тип double.
        d - double
    */ 
    std::cout << "5) " << 1e-3 << " тип " << typeid(1e-3).name() << std::endl;

    /*
        6) Число 1024 в шестнадцатеричной экспоненциальной форме (степень 3) двойки), тип double.
        1024 = 4*2^8
        d - double 
    */
    std::cout << "6) " << 0x4p8 << " тип " << typeid(0x4p8).name() << std::endl;

    /*
        7) Символ новая строка (\n) как символьный литерал.
        для наглядности вывел \n, так-то правильно считать его '\n', как я делаю в typeid. просто иначе он перенос сделает и все.
        c - char
    */
    std::cout << "7) " << "\\n" << " тип " << typeid('\n').name() << std::endl;

    /*
        8) Строка, содержащая кавычки и обратный слеш, без экранирования (сырая строка).
        A3 - массив длинной 3 
        _с - char 
        соответственно, тип у него const char[3]
    */
    std::cout << "8) " << R"(\")" << " тип " << typeid(R"(\")").name() << std::endl;

    /*
        9) Логическое значение «истина».
        используем boolalpha, чтобы вывести true, а не 1. 
        b - bool
    */
    std::cout << "9) "  << std::boolalpha << true << " тип " << typeid(true).name() << std::endl;

    /*
        10) Нулевой указатель.
        D - префикс маркер. Показывает, что это новый встроенный тип, который определен через decltype
        n - nullptr соответственно
    */
    std::cout << "10) " << nullptr << " тип " << typeid(nullptr).name() << std::endl;
}