/*
    Симдяшкин Александр Денисович
    Попробуйте поработать со стандартными эскейп-последовательностями.
*/

#include <iostream>

int main()
{
    std::cout << "Нулевой символ: \01" << std::endl;
    std::cout << "Табуляция:\tСтолбец 1\tСтолбец 2\n";

    std::cout << "Путь к файлу: C:\\Program Files\\App\\n\n";

    std::cout << "Цитата: \"C++ - отличный язык\"\n";
    std::cout << "Символ апострофа: 'A'\n";
    std::cout << "Удаление символа: 1234\b\b56\n";
    std::cout << "Возврат каретки: ABCDEF\rXY\n";
    std::cout << "Перевод строки:\nПервая линия\nВторая линия\n";
    std::cout << "Звуковой сигнал (Bell): \a\n";

    char double_quote = '\"';
    char single_quote = '\'';

    std::cout << "Символ кавычки: " << double_quote << ", символ апострофа: " << single_quote << "\n";

    std::cout << "Шестнадцатеричные коды: \x48\x65\x6c\x6c\x6f\x21\n";
    std::cout << "Восьмеричные коды: \110\145\154\154\157\041\n";

    std::cout << "Разрыв строки с нулевым символом: " << "start\0" << "123end\n";

    std::cout << "Разрыв строки с HEX-кодом: " << "\x41" << "BC\n";

    return 0;
}