/*
**ТИПЫ ДАННЫХ**
Попробуйте вывести на экран размеры различных типов данных
Какой тип данных вы бы выбрали для хранения следующих диапазонов:
а) 0 ... 200
б) 1000 ... 70000
в) -50000 ... +50000
г) 0 ... 3,1415
*/

#include <iostream>

int main()
{
    std::cout << "bool: " << sizeof(bool) << " байт" << std::endl;
    
    std::cout << "int: " << sizeof(int) << " байт" << std::endl;
    
    std::cout << "char: " << sizeof(char) << " байт" << std::endl;
    
    std::cout << "double: " << sizeof(double) << " байт" << std::endl;
    
    // a) unsigned char - т.к. от 0 до 255. занимает 1 байт 
    // б) unsigned int - т.к. от 0 до 4 294 967 295 при 4 байт. 
    // в) int - т.к. от −2 147 483 648 до 2 147 483 647 при 4 байт. 
    // г) float - т.к. от +/- 3.4E-38 до 3.4E+38 при 4 байт.
    
    return 0;
}