/*
    Симдяшкин Александр Денисович
    На примере глобальной переменной покажите разницу между объявлением (extern, можно повторять) 
    и определением (без extern, только один раз), продемонстрировав, что переменную можно использовать до её определения, 
    так как компилятору достаточно знать её имя и тип из объявления.
*/
#include <iostream>

// Память тут не выделяется. Так же можно несколько раз объявлять, ругаться не будет компилятор 
extern int globalCounter; 
extern int globalCounter; 


int main() {
    std::cout << "Текущее значение counter: " << globalCounter << std::endl;
    return 0;
}

