/*
    Симдяшкин Александр Денисович
    Придумайте какие-нибудь интересные действия с данными эскейп-последовательностями. 
    Например, сделать вывод какого-нибудь цветного текста или даже нарисовать буквами какой-нибудь цветной рисунок.
*/
#include <iostream>

int main()
{
    std::cout << "\33[2J\33[;H\33[?25l";
    std::cout << "       \33[91m/\\\33[m\n";
    std::cout << "      \33[91m/  \\\33[m\n";
    std::cout << "     \33[91m/____\\\33[m\n";
    std::cout << "    \33[103;30m|  []  |\33[m\n";
    std::cout << "    \33[42;30m|______|\33[m\n\n";

    std::cout << "\33[1;36mМне очень\33[m\n";
    std::cout << "\33[4;35mСильно\33[m\n";
    std::cout << "\33[7;32mНравится\33[m\n\n";

    std::cout << "\33(0"; 
    std::cout << "lqqqqqk\n";
    std::cout << "x\33(B \33[93mC++\33[m \33(0x\n";
    std::cout << "mqqqqqj\n";
    std::cout << "\33(B"; 
    std::cout << "\33[?25h\n";
}